[{"title": "PrimateObservationOntology", "subHead": "Knowledge graph based webapp on primate observations", "desc": "The application is based on a custom ontology constructed through NCBI taxonomy using observations extracted from the iNaturalist database. Using streamlit as the GUI frontend, this app serves the user with the geographical data of primate observations in the last few years, alongside interesting trends in it.", "imgUrl": "images/projects/primate-ontology.png", "repoUrl": "https://github.com/AlexHoorn/PrimateObservationsOntology", "highlight": true}, {"title": "iPlantify", "subHead": "Android app using InceptionNet on iNaturalist", "desc": "An Android Application used for identification of a different number of plants and flowers using the phone's camera and displaying information from the web. It is based on the TensorFlow Lite framework used for image classification in the backend. Data training has been done on computer using the python variant of the same framework and images scraped over the internet.", "imgUrl": "images/projects/iplantify.png", "repoUrl": "https://github.com/sunnysoni97/iplantify_droid", "highlight": true}, {"title": "HandReader", "subHead": "Kivy-based app on MNIST dataset", "desc": "A Kivy GUI framework based cross platform application which uses Tensorflow as the backend for neutral network based classification. The data training is done using the MNIST dataset and the application uses OpenCV to preprocess images taken through the camera and local files.", "imgUrl": "images/projects/hand-reader.png", "repoUrl": "https://github.com/sunnysoni97/hand_reader", "highlight": true}, {"title": "Draw", "subHead": "an 8-bit custom interpretter for drawing using C++", "desc": "A custom language interpreter to be used as an educational drawing and programming tool for children. The complete application has been designed using the legacy \"conio.h\" in C++ environment, compiled using Borland's TurboC++ compiler. It supports a large variety of editing functions as well as options for saving and loading data from disk.", "imgUrl": "images/projects/udraw.png", "repoUrl": "https://github.com/sunnysoni97/draw_cpp", "highlight": false}, {"title": "LibMan PHP", "subHead": "a library management ERP using PHP and MySQL", "desc": "An Enterprise Resource Planning package, running on the PHP backend based web server using MySQL database stored over the network. The complete application suite performs various functions of the college library inventory processing, supports credential based login features and similar functionalities. This project uses the combination of Full Stack Web Development languages such as PHP, JavaScript, SQL, CSS and HTML.", "imgUrl": "images/projects/libman.png", "repoUrl": "https://github.com/sunnysoni97/libman_php", "highlight": false}]