[{"year": "2013", "title": "2nd Last Year of High School", "desc": "Gained distinctions in Informatic Olympiads, Debates and Tech competitions. Inaugrated Tech Society as Vice President and selected as Class Representative of the year."}, {"year": "2014", "title": "Last Year of High School", "desc": "Distinctions in Olympiads and Tech competitions. Promoted to President of the Tech Society and selected as Class Representative second year in a row."}, {"year": "2015", "title": "Graduated High School", "desc": "Graduated with good grades, highest in C++ Programming and English. Attempted SAT and TOEFL with good scores."}, {"year": "2016", "title": "Started Bachelors in Computer Science Engineering", "desc": "Cleared state university engineering entrance (IPUCET) and started Bachelors in my hometown."}, {"year": "2017", "title": "2nd Year of Bachelors", "desc": "Gained Hewlett Packard Enterprise certification for PHP (with SQL). Completed workshop in Android software development. Achieved first victories in competitive Counter Strike competitions."}, {"year": "2018", "title": "3rd Year of Bachelors", "desc": "Gained Microsoft Technology Associate certification for Python with training in AI. Some more wins in Counter Strike."}, {"year": "2019", "title": "Last Year of Bachelors", "desc": "Started the year with a streak of CS victories. Underwent industrial training at PayTM and IRCTC. Started working on AI projects for the bachelor's finale."}, {"year": "2020", "title": "Graduated from Engineering, on-to Masters", "desc": "Received admits from multiple universities including Vrije Universiteit, University of Leiden and University of Pittsburgh for Master programs in AI."}, {"year": "2021", "title": "Started M.Sc. in AI", "desc": "Started my 2-year degree programme at Vrije Universiteit Amsterdam (with UvA)."}, {"year": "2022", "title": "Undergoing educational training", "desc": "Started working as a Student Teaching Assistant and Data Scientist besides my studies."}, {"year": "2023", "title": "Completed Masters", "desc": "Finished my Master's programme with an excellent grade for my first research paper (on Federated Learning) under my supervisors at UvA and TU/E."}]